INSERT INTO student (name, kana_name, nickname, email, area, age, sex) VALUES
    ('佐藤太郎', 'サトウタロウ', 'たろう', 'taro.sato@example.com', '東京', 20, '男性'),
    ('鈴木花子', 'スズキハナコ', 'ハナコ', 'hanako.suzuki@example.com', '大阪', 32, '女性'),
    ('高橋一郎', 'タカハシイチロウ', 'イチ', 'ichiro.takahashi@example.com', '愛知', 22, '男性'),
    ('田中美咲', 'タナカミサキ', 'ミサキ', 'misaki.tanaka@example.com', '福岡', 19, '女性'),
    ('伊藤健', 'イトウケン', 'ケン', 'ken.ito@example.com', '北海道', 40, 'その他');

INSERT INTO students_courses (student_id, course_name, course_start, course_end) VALUES
    ('1', 'JAVAコース', '2024-04-01 09:00:00', '2024-07-31 17:00:00'),
    ('1', 'AWSコース', '2024-04-01 10:00:00', '2024-07-31 18:00:00'),
    ('2', 'JAVAコース', '2024-05-01 09:30:00', '2024-08-31 16:30:00'),
    ('2', 'デザインコース', '2024-05-01 11:00:00', '2024-08-31 17:00:00'),
    ('3', 'AWSコース', '2024-06-01 09:00:00', '2024-09-30 17:00:00'),
    ('3', 'デザインコース', '2024-06-01 10:30:00', '2024-09-30 18:00:00'),
    ('4', 'AWSコース', '2024-07-01 09:00:00', '2024-10-31 17:00:00'),
    ('4', 'JAVAコース', '2024-07-01 10:00:00', '2024-10-31 18:00:00'),
    ('5', 'デザインコース', '2024-08-01 09:00:00', '2024-11-30 17:00:00'),
    ('5', 'JAVAコース', '2024-08-01 10:00:00', '2024-11-30 18:00:00');